#ifndef __BASIC_TYPES_HPP__
#define __BASIC_TYPES_HPP__

#if defined(TYPETRAITS_SUPPORTED)
    #include <type_traits>
#endif

STATIC_CHECK( sizeof(INT64_NUMBER) == 8, "sizeof(long long) is unexpected" );
STATIC_CHECK( sizeof(int)        == 4, "sizeof(int) is unexpected" );
STATIC_CHECK( sizeof(long) == 4 || sizeof(long) == 8, "sizeof(long) is unexpected" );
STATIC_CHECK( sizeof(short)      == 2, "sizeof(short) is unexpected" );
STATIC_CHECK( sizeof(char)       == 1, "sizeof(char) is unexpected" );
STATIC_CHECK( sizeof(bool)       == 1, "sizeof(bool) is unexpected" );
STATIC_CHECK( sizeof(float)      == 4, "sizeof(float) is unexpected" );
STATIC_CHECK( sizeof(double)     == 8, "sizeof(double) is unexpected" );

STATIC_CHECK( sizeof(void *) * 8 == WORD_SIZE, "incorrect WORD_SIZE" );

#if WORD_SIZE == 32
    typedef unsigned int uiw;
    typedef signed int iw;
#elif WORD_SIZE == 64
    typedef UINT64_NUMBER uiw;
    typedef INT64_NUMBER iw;
#else
    #error incorrect WORD_SIZE
#endif
typedef unsigned int uint;
typedef UINT64_NUMBER ui64;
typedef unsigned int ui32;
typedef unsigned short ui16;
typedef unsigned char ui8;
typedef unsigned char byte;
typedef float f32;
typedef double f64;
typedef INT64_NUMBER i64;
typedef signed int i32;
typedef signed short i16;
typedef signed char i8;
typedef bool bln;

#if WORD_SIZE == 32
    const uiw uiw_max = 4294967295;  //  0xFFffFFff
    const uiw uiw_min = 0;  //  0x00000000
    const iw iw_max = 2147483647;  //  0x7FffFFff
    const iw iw_min = -2147483647 - 1;  //  0x80000000
#elif WORD_SIZE == 64
    const uiw uiw_max = ASUINT64( 18446744073709551615 );  //  0xFFffFFffFFffFFff
